tap "damascenorafael/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "romkatv/powerlevel10k"

# Formulae
brew "awscli"
brew "bat"
brew "bitwarden-cli"
brew "btop"
brew "cloc"
brew "cmatrix"
brew "exa"
brew "exiftool"
brew "feh"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "glow"
brew "gnupg"
brew "imagemagick"
brew "lsd"
brew "make"
brew "mas"
brew "neofetch"
brew "neovim"
brew "node"
brew "pyenv"
brew "python@3.9"
brew "python@3.10"
brew "speedtest-cli"
brew "thefuck"
brew "unar"
brew "vim"
brew "zsh-autosuggestions"
brew "zsh-fast-syntax-highlighting"
brew "zsh-history-substring-search"
brew "romkatv/powerlevel10k/powerlevel10k"

# Casks
cask "adobe-dng-converter"
cask "adobe-creative-cloud"
cask "airbuddy"
cask "anki"
cask "arc"
cask "coconutbattery"
cask "datweatherdoe"
cask "deepl"
cask "discord"
cask "docker"
cask "drawio"
cask "fig"
cask "firefox"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "google-drive"
cask "hammerspoon"
cask "hiddenbar"
cask "intellij-idea"
cask "iterm2"
cask "itsycal"
cask "jdownloader"
cask "key-codes"
cask "libreoffice"
cask "lrtimelapse"
cask "mactex"
cask "mactracker"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "miro"
cask "nordvpn"
cask "notion"
cask "postman"
cask "pycharm"
cask "raycast"
cask "reminders-menubar"
cask "sf-symbols"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"

# Mac App Store
mas "Bakery", id: 1575220747
mas "Bitwarden", id: 1352778147
mas "Crouton", id: 1461650987
mas "Debit & Credit", id: 882637653
mas "Health Auto Export", id: 1115567069
mas "Hidden Bar", id: 1452453066
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Notability", id: 360593530
mas "Parcel", id: 639968404
mas "rcmd", id: 1596283165
mas "Scaler", id: 1612708557
mas "Unsplash Wallpapers", id: 1284863847
mas "Xcode", id: 497799835

