tap "damascenorafael/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"

# Import
cask "raycast"
cask "arc"
cask "karabiner-elements"
brew "mas"
mas "Bitwarden", id: 1352778147
mas "rcmd", id: 1596283165
brew "neovim"
brew "zsh-autosuggestions"
brew "zsh-fast-syntax-highlighting"
brew "zsh-history-substring-search"
brew "powerlevel10k"
brew "zoxide"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "warp"

# Formulae
brew "bat"
brew "bitwarden-cli"
brew "btop"
brew "cloc"
brew "cmatrix"
brew "exiftool"
brew "fastlane"
brew "feh"
brew "ffmpeg"
brew "forgit"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "glow"
brew "gnupg"
brew "imagemagick"
brew "lsd"
brew "make"
brew "neofetch"
brew "node"
brew "pnpm"
brew "pyenv"
brew "python@3.9"
brew "python@3.10"
brew "speedtest-cli"
brew "thefuck"
brew "typst"
brew "unar"
brew "yarn"

# Casks
cask "adobe-dng-converter"
cask "adobe-creative-cloud"
cask "airbuddy"
cask "anki"
cask "datweatherdoe"
cask "discord"
cask "docker"
cask "drawio"
cask "firefox"
cask "google-chrome"
cask "google-drive"
cask "hammerspoon"
cask "iina"
cask "itsycal"
cask "jdownloader"
cask "jukebox"
cask "key-codes"
cask "libreoffice"
cask "lrtimelapse"
cask "mactracker"
cask "mediamate"
cask "notion"
cask "protonvpn"
cask "proxyman"
cask "sf-symbols"
cask "upscayl"
cask "visual-studio-code"
cask "vivid"
cask "vlc"
cask "whatsapp"

# Mac App Store
mas "Bakery", id: 1575220747
mas "Crouton", id: 1461650987
mas "Flighty", id: 1358823008
mas "Hidden Bar", id: 1452453066
mas "Keynote", id: 409183694
mas "Notability", id: 360593530
mas "Parcel", id: 639968404
mas "Scaler", id: 1612708557
mas "Unsplash Wallpapers", id: 1284863847
mas "Xnip", id: 1221250572

# VS Code
vscode "adelphes.android-dev-ext"
vscode "adpyke.codesnap"
vscode "arjun.swagger-viewer"
vscode "bierner.color-info"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "henoc.svgeditor"
vscode "james-yu.latex-workshop"
vscode "kevinrose.vsc-python-indent"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "mathiasfrohlich.kotlin"
vscode "mikestead.dotenv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vsliveshare.vsliveshare"
vscode "myriad-dreamin.tinymist"
vscode "naumovs.color-highlight"
vscode "nvarner.typst-lsp"
vscode "pflannery.vscode-versionlens"
vscode "pnp.polacode"
vscode "quandinh.onehalf-dark"
vscode "redhat.vscode-yaml"
vscode "richterger.perl"
vscode "sswg.swift-lang"
vscode "streetsidesoftware.code-spell-checker"
vscode "suhay.vscode-editor-group-minimizer"
vscode "tamasfe.even-better-toml"
vscode "theholycoder.swagger-tools"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "wallabyjs.console-ninja"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
vscode "yzane.markdown-pdf"

