tap "damascenorafael/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "romkatv/powerlevel10k"

# Formulae
brew "zsh-autosuggestions"
brew "zsh-fast-syntax-highlighting"
brew "zsh-history-substring-search"
brew "python@3.9"
brew "python@3.10"
brew "awscli"
brew "bat"
brew "btop"
brew "exiftool"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "glow"
brew "gnupg"
brew "imagemagick"
brew "lsd"
brew "mas"
brew "make"
brew "neovim"
brew "node"
brew "pyenv"
brew "ranger"
brew "speedtest-cli"
brew "tig"
brew "tree"
brew "romkatv/powerlevel10k/powerlevel10k"

# Casks
cask "adobe-dng-converter"
cask "adobe-creative-cloud"
cask "airbuddy"
cask "alt-tab"
cask "clocker"
cask "coconutbattery"
cask "datweatherdoe"
cask "deepl"
cask "discord"
cask "docker"
cask "fig"
cask "firefox"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "hiddenbar"
cask "intellij-idea"
cask "iterm2"
cask "itsycal"
cask "jdownloader"
cask "lrtimelapse"
cask "maccy"
cask "mactex"
cask "mactracker"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "miro"
cask "nordvpn"
cask "notion"
cask "pycharm"
cask "raycast"
cask "reminders-menubar"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"

# Mac App Store
mas "AdBlock", id: 1402042596
mas "Amphetamine", id: 937984704
mas "Bakery", id: 1575220747
mas "Bitwarden", id: 1352778147
mas "Color Peeker", id: 1592573138
mas "Debit & Credit", id: 882637653
mas "Hush", id: 1544743900
mas "ICE Buddy", id: 1595947689
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Notability", id: 360593530
mas "Parcel", id: 639968404
mas "Pure Paste", id: 1611378436
mas "Refined GitHub", id: 1519867270
mas "scaler", id: 1612708557
mas "TestFlight", id: 899247664
mas "Xcode", id: 497799835

